perf-tests/mongo-perf/minikube/aRun
mongo client connection created with mongodb://main_admin:abc123@192.168.39.248:31314
[OVERALL], RunTime(ms), 3639
[OVERALL], Throughput(ops/sec), 1374.0038472107722
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.35724100027480077
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 13
[TOTAL_GC_TIME_%], Time(%), 0.35724100027480077
[READ], Operations, 2451
[READ], AverageLatency(us), 608.1497348021215
[READ], MinLatency(us), 128
[READ], MaxLatency(us), 124543
[READ], 95thPercentileLatency(us), 1165
[READ], 99thPercentileLatency(us), 2885
[READ], Return=OK, 2451
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1328.0
[CLEANUP], MinLatency(us), 1328
[CLEANUP], MaxLatency(us), 1328
[CLEANUP], 95thPercentileLatency(us), 1328
[CLEANUP], 99thPercentileLatency(us), 1328
[UPDATE], Operations, 2549
[UPDATE], AverageLatency(us), 647.2499019223225
[UPDATE], MinLatency(us), 154
[UPDATE], MaxLatency(us), 14623
[UPDATE], 95thPercentileLatency(us), 1365
[UPDATE], 99thPercentileLatency(us), 3377
[UPDATE], Return=OK, 2549